tests/load/artillery/alerts.yml
# Artillery reference implementation: the shared read scenario.
#   make load-tool TOOL=artillery
# arrivalRate = new virtual users per second, each running the flow once:
# an open model, like k6's constant-arrival-rate and vegeta's -rate.
config:
  target: http://web:8080
  phases:
    - name: steady
      duration: 30
      arrivalRate: 200
scenarios:
  - name: list alerts
    flow:
      - get:
          url: /api/alerts?limit=50
          # The session `make load-tool` minted (app.cli), from the environment.
          headers:
            Cookie: "{{ $env.SESSION_COOKIE }}"